cherry 12613
plum 8742
red 8722
ripe 8372
spice 8008
black 6904
berry 6692
fresh 6428
firm 5925
currant 5604
apple 5485
acidity 5442
rich 5310
light 5232
blackberry 5033
mineral 5016
white 4698
pear 4179
dried 4071
spicy 3901
full-bodied 3780
dark 3752
raspberry 3624
texture 3548
peach 3484
oak 3396
medium-bodied 3370
juicy 3346
floral 3213
lively 3195
herb 3190
core 3156
cabernet 3117
licorice 3114
balanced 3015
tobacco 2881
lemon 2876
vanilla 2837
crisp 2816
focused 2655
citrus 2638
bright 2629
sweet 2596
supple 2521
elegant 2390
soft 2294
earth 2287
edge 2284
fine 2233
slightly 2224
green 2167
smoky 2163
lingering 2153
chocolate 2121
sauvignon 2118
complex 2110
structure 2097
clean 2087
pepper 2062
cedar 2045
intense 2033
fruity 1996
melon 1973
aftertaste 1945
chewy 1883
creamy 1879
offering 1874
plenty 1868
wild 1863
accents 1836
medium 1832
smoke 1814
toasty 1801
smooth 1779
silky 1774
concentrated 1770
note 1758
apricot 1728
honey 1716
pretty 1716
merlot 1683
vibrant 1663
anise 1646
fig 1646
earthy 1637
nicely 1624
round 1601
lots 1594
modest 1547
nice 1531
touch 1524
dense 1520
balance 1515
dry 1511
almond 1506
it's 1483
mix 1479
tangy 1466
polished 1453
savory 1441
body 1374
solid 1363
lime 1362
orange 1360
there's 1346
grapefruit 1345
pure 1331
generous 1308
subtle 1291
linger 1287
toast 1287
tannic 1278
lovely 1262
time 1261
length 1258
frame 1255
herbal 1255
tart 1254
depth 1242
strawberry 1239
tight 1222
tea 1205
finishing 1191
lightly 1159
coffee 1145
racy 1137
syrah 1108
finishes 1083
appealing 1078
blueberry 1074
lean 1070
refined 1053
velvety 1030
delicious 1016
delicate 1001
nose 999
roasted 993
simple 986
pineapple 979
refreshing 975
intensity 971
mocha 932
toasted 918
crushed 914
sage 910
expressive 897
little 884
tar 881
fleshy 879
rustic 869
harmonious 866
minerally 860
candied 857
peel 849
ginger 840
features 836
franc 820
lingers 812
pleasant 798
cassis 790
follow 787
cedary 780
distinctive 773
leather 772
mouthwatering 768
feel 760
zest 756
grip 754
featuring 747
sleek 743
cream 741
grenache 734
olive 732
violet 720
graphite 713
lush 709
powerful 708
delivers 707
lead 691
layers 690
concentration 683
accented 675
moderate 675
followed 670
layered 670
complexity 666
well-integrated 662
plush 655
broad 646
peppery 637
boysenberry 636
aromatic 635
leaf 625
light-bodied 623
bitter 616
austere 613
zesty 613
dusty 611
focus 611
tightly 598
details 597
straightforward 594
that's 590
color 588
medium- 587
sangiovese 587
wood 585
mint 583
stone 582
mingle 579
cellaring 578
thick 576
loamy 574
version 570
taut 568
espresso 565
muscular 565
richness 560
persistent 557
structured 553
petit 552
mature 550
chardonnay 548
flowers 547
tropical 546
loads 541
deep 540
verdot 536
finesse 535
rose 533
nectarine 532
impressive 529
grilled 528
jammy 522
cocoa 519
retrospective 518
vintage 518
herbs 517
baked 510
honeysuckle 510
supported 510
hazelnut 505
vivid 505
aroma 503
pinot 495
exotic 493
midpalate 490
beautifully 482
forward 480
cinnamon 479
age 478
butter 477
iron 477
flavorful 469
framed 466
plump 466
blanc 461
yellow 459
short 456
attractive 446
spices 441
meat 438
beautiful 437
profile 435
accent 433
graceful 422
overtones 421
well-balanced 421
berries 419
tasty 419
blossom 418
sandalwood 418
quince 415
rosé 415
food 414
raisin 414
range 411
elements 407
nutmeg 406
tangerine 406
bold 404
malbec 403
medium-weight 403
laced 401
add 394
chalky 392
cut 392
sauce 392
singed 391
leading 390
fine-grained 383
skin 378
lithe 375
minerality 374
spiced 374
wonderful 374
warm 372
wet 372
try 369
harmony 367
integrated 362
gentle 361
gorgeous 361
beam 359
buttery 359
tannin 359
stays 358
front 357
delivering 356
ground 356
meaty 355
cellar 354
touches 354
underbrush 354
mourvèdre 353
mouthful 347
wound 346
echo 345
packed 344
power 344
ample 343
open-knit 343
fragrant 339
strong 338
alluring 337
curd 336
caramel 335
de 335
mulled 335
seductive 335
elegance 334
firmly 333
excellent 330
succulent 325
well-structured 325
clove 324
cola 323
butterscotch 322
displays 322
lacks 322
mango 321
stony 321
fill 317
paste 317
pie 317
tasted 317
stylish 315
nuances 311
picking 309
citrusy 308
easy 308
vertical 307
caressing 305
champagne 305
giving 303
compact 298
mark 297
pomegranate 297
damson 294
snappy 293
riesling 292
overall 291
enticing 289
modern 288
displaying 287
drying 287
kirsch 287
jam 286
cranberry 285
backbone 284
bordeaux 283
california 279
direct 279
gamy 278
adds 277
bottle 277
finely 277
opulent 277
hard 276
adding 275
slate 273
off-dry 272
ready 272
streak 272
wrapped 272
moderately 271
weight 270
bay 268
density 268
soften 266
prune 265
starts 263
open-textured 261
sweetness 260
balsamic 258
picks 257
steeped 256
remains 255
tastes 254
grippy 251
pastry 251
game 248
tarry 248
shiraz 245
bracing 244
chunky 243
star 242
blind 241
ganache 241
freshness 240
shaded 240
verbena 240
framing 239
trim 239
grace 238
straw 238
blend 237
chamomile 237
petal 237
scents 237
fans 236
filled 235
hold 235
thyme 235
underlying 235
carries 234
oaky 234
flesh 233
nut 233
honeyed 232
grapey 231
viognier 231
marked 230
tough 229
blood 228
revealing 228
hot 227
terrific 227
leathery 225
brioche 224
creamed 222
consistent 221
friendly 221
crunchy 220
bread 219
emerge 219
minty 219
rock 219
box 217
lemony 216
lined 216
mushroom 216
purity 216
rounded 216
coconut 215
inviting 215
perfumed 215
sense 215
bean 214
built 214
gooseberry 214
edges 213
stay 213
beef 212
match 212
traditional 212
comes 211
echoes 211
zinfandel 210
quality 209
passion 208
plummy 208
mouthfeel 207
twice 207
watermelon 207
leafy 206
honeydew 205
mousse 204
gaining 203
assertive 202
underneath 202
dash 201
deftly 201
gently 201
sanguine 201
spine 201
astringent 200
briary 200
weaving 200
effort 199
layer 199
charcoal 197
dominate 197
glide 197
throughout 197
beefy 196
forest 196
matched 196
exhibits 195
glazed 195
grass 195
salted 195
short-term 195
chalk 194
easygoing 193
exhibiting 193
fruits 193
despite 192
raw 192
detailed 191
coulis 190
background 189
cake 188
running 188
macerated 187
youthful 187
develop 186
fairly 186
lot 186
sinewy 186
slight 186
blanched 185
burgundy 184
rind 184
bead 182
luscious 180
carry 178
improve 178
easily 177
echoing 177
extracted 177
pink 177
serious 177
tones 177
milk 176
easy-drinking 175
briar 174
grape 174
snap 174
support 174
woven 174
persistence 173
preserves 173
start 172
well-defined 172
disgorged 170
flinty 170
intriguing 170
set 170
well-focused 170
array 169
fennel 169
powder 169
sour 169
element 168
melted 168
asian 167
ruby 167
suave 166
presence 165
approachable 163
holds 163
lavender 163
blackberries 162
coarse 162
gains 162
minerals 162
package 162
personality 162
petite 162
whiff 162
pit 161
compote 160
knit 160
tomato 160
holding 159
lemon-lime 159
offset 159
rhubarb 159
zip 159
extremely 158
flint 158
fruitcake 158
pencil 158
coming 157
bittersweet 156
guava 156
light- 156
makes 156
boasting 155
dimension 155
pleasantly 155
tarragon 155
firms 154
well-knit 154
sirah 153
extra 152
heavy 152
impression 152
shadings 152
accenting 151
decadent 151
mesquite 151
mouthfilling 151
shy 151
cherries 150
noir 150
decant 149
leaving 149
loam 149
gain 148
salt 148
cigar 147
hinting 147
definition 146
energy 146
persist 146
textured 146
decent 145
steely 145
walnut 145
sporting 144
kosher 143
combines 142
pleasing 142
accessible 141
drinking 141
gliding 141
somewhat 141
feature 140
loaded 140
richly 140
baking 139
drive 139
incense 139
restrained 139
ripeness 139
seamless 139
maturing 138
persists 138
plums 138
tempranillo 138
glass 137
underscored 137
aging 136
defined 136
dough 136
highlight 136
nutty 136
persisting 136
biscuit 135
percent 135
twinge 135
pine 134
well-spiced 134
charming 133
mingling 133
thread 133
undertones 133
roussanne 132
air 131
brambly 131
brooding 131
high-toned 131
sea 131
understated 131
zingy 130
carried 129
chive 129
outstanding 129
piecrust 129
band 128
dill 128
golden 128
grassy 128
lychee 128
appeal 127
cracked 127
integrate 127
leads 127
poached 127
cardamom 126
gritty 126
beeswax 125
horizontal 125
floor 124
impressively 124
menthol 124
play 124
stewed 124
tasting 124
cinsault 123
sel 123
bursting 122
meringue 122
brisk 121
enjoy 121
hollow 121
sparkler 121
value 121
wonderfully 121
remain 120
dose 119
tiers 119
typical 119
base 118
burst 118
candy 118
crème 118
leaves 118
sharp 118
beauty 117
eucalyptus 117
expression 117
bubbly 116
pick 116
tempting 116
underpinning 116
barbera 115
builds 115
effortlessly 115
price 115
sémillon 115
toffee 115
unctuous 115
woody 115
burly 114
deeply 114
fleur 114
well-proportioned 114
aromatics 113
flash 113
jazzy 113
lanolin 113
one-dimensional 113
raisiny 113
woodsy 112
combination 111
lengthy 111
enjoyable 110
lighter 110
meyer 110
rough 110
run 110
well-made 110
mellow 109
carrying 108
flavored 108
perfumy 108
petrol 108
brimming 107
date 107
distinct 107
kumquat 107
reveals 107
saline 107
undertone 107
chime 106
delicately 106
doesn't 106
linear 106
lip-smacking 106
persimmon 106
polish 106
chocolaty 105
mild 105
rosemary 105
sharply 105
dessert 104
exuberant 104
gracefully 104
joined 104
keeping 104
provide 104
slowly 104
sturdy 104
fold 103
honest 103
intensely 103
quickly 103
real 103
stage 103
supporting 103
bitterness 102
extend 102
gripping 102
gutsy 102
juniper 102
lend 102
packs 102
taste 102
classy 101
freshly 101
huckleberry 101
offer 101
smoldering 101
bacon 100
fat 100
mineral-tinged 100
papaya 100
reserved 100
aperitif 99
chestnut 99
grainy 99
refinement 99
robust 99
showy 99
sip 99
smells 99
unfold 99
alder 98
allied 98
center 98
charm 98
enticingly 98
heat 98
mandarin 98
marzipan 98
takes 98
classic 97
deliciously 97
emerges 97
fun 97
goes 97
inky 97
lasting 97
mouth 97
weaves 97
crafted 96
hay 96
hearty 96
runs 96
settle 96
smoothly 96
combine 95
firming 95
playing 95
sliced 95
fresh-cut 94
hang 94
pithy 94
waxy 94
cobbler 93
engaging 93
expansive 93
mouthcoating 93
precise 93
seamlessly 93
vegetal 93
weave 93
complete 92
confiture 92
heather 92
driven 91
quinine 91
remaining 91
<i>terroir</i> 90
lacy 90
marks 90
pâte 90
airy 89
closed 89
plus 89
potential 89
well-crafted 89
basic 88
currants 88
harmoniously 88
lift 88
light-weight 88
muscle 88
stand 88
stuffing 88
charry 87
drives 87
driving 87
evoking 87
glides 87
lends 87
modestly 87
raspberries 87
root 87
truffle 87
mixed 86
nuance 86
reserve 86
line 85
oily 85
torte 85
touriga 85
gris 84
hangs 84
sails 84
smoked 84
undertow 84
varietal 84
bell 83
bramble 83
prominent 83
appealingly 82
buried 82
carignane 82
component 82
custard 82
pudding 82
chablis 81
charred 81
deft 81
earthiness 81
gravelly 81
well-built 81
amazing 80
banana 80
brown 80
chianti 80
edgy 80
lending 80
linzer 80
marmalade 80
satisfying 80
frames 79
jasmine 79
remarkably 79
thanks 79
distinctly 78
maturity 78
nero 78
reveal 78
riding 78
amid 77
appellation 76
elegantly 76
exciting 76
overtone 76
balancing 75
carignan 75
evokes 75
flower 75
indian 75
barrel 74
cooked 74
don't 74
momentum 74
sugar 74
textbook 74
build 73
delicacy 73
leesy 73
marsanne 73
non-blind 73
port 73
puree 73
sports 73
sweet-tasting 73
alcohol 72
braised 72
flattering 72
heady 72
essence 71
impart 71
kiwifruit 71
soon 71
stretch 71
tad 71
up-front 71
wait 71
boasts 70
bottles 70
traction 70
bergamot 69
chenin 69
class 69
emerging 69
held 69
melded 69
pea 69
plays 69
reminiscent 69
salty 69
softly 69
syrupy 69
benefit 68
check 68
components 68
push 68
tang 68
tension 68
zippy 68
balances 67
cloying 67
frankly 67
key 67
pungent 67
roast 67
top 67
well-meshed 67
brawny 66
especially 66
fabulous 66
lilac 66
nebbiolo 66
pith 66
producer 66
serves 66
brunello 65
flavors; 65
funky 65
nonetheless 65
2015) 64
diluted 64
dusky 64
fan 64
framework 64
latent 64
life 64
previously 64
pronounced 64
reviewed 64
ride 64
allspice 63
bush 63
highlights 63
old-school 63
pippin 63
sappy 63
spring 63
super 63
vibrancy 63
complement 62
effusive 62
form 62
garnacha 62
massive 62
providing 62
scale 62
superb 62
tinta 62
violets 62
coating 61
fresh-tasting 61
lemongrass 61
maintains 61
sophisticated 61
sway 61
unwind 61
wines 61
botrytis 60
clean-cut 60
expand 60
nuts 60
potent 60
smooth-textured 60
spiciness 60
stuff 60
unfolds 60
amount 59
kept 59
leans 59
manages 59
orchard 59
precision 59
starting 59
stiff 59
unusual 59
'96 58
asparagus 58
detail 58
feels 58
gravel 58
herbaceous 58
integration 58
shortbread 58
barolo 57
drinks 57
help 57
juiciness 57
measure 57
narrow 57
pickled 57
surprisingly 57
tinged 57
unadorned 57
underscoring 57
viscous 57
'97 56
backdrop 56
baker's 56
burnt 56
display 56
estate 56
here's 56
marjoram 56
mixing 56
overdone 56
slivered 56
solidly 56
winery 56
<i>garrigue</i> 55
angular 55
dark-colored 55
densely 55
dominates 55
feet 55
flanked 55
flashy 55
follows 55
garnet 55
gewürztraminer 55
herb-tinged 55
iodine 55
italian 55
jonagold 55
juice 55
loganberry 55
muddled 55
nacional 55
oil 55
peppercorn 55
proportioned 55
provides 55
stemmy 55
well-cut 55
aggressive 54
blockbuster 54
brings 54
complemented 54
enlivened 54
filling 54
lacking 54
mulberry 54
oaked 54
past 54
peachy 54
reduction 54
sensation 54
staying 54
subdued 54
tapenade 54
(2008) 53
brûlée 53
creaminess 53
delightful 53
highlighted 53
maple 53
metallic 53
release 53
smoke-tinged 53
(december 52
alicante 52
appear 52
auslese 52
awkward 52
bite 52
brilliant 52
bring 52
bursts 52
celery 52
fade 52
gala 52
verve 52
counoise 51
fruit-forward 51
liberally 51
malvasia 51
obvious 51
pulls 51
pumping 51
subtlety 51
beginning 50
dishes 50
dolcetto 50
indeed 50
maintaining 50
medicinal 50
mildly 50
roses 50
vermentino 50
'98 49
fluid 49
hefty 49
lightweight 49
medley 49
meshed 49
muscat 49
pushes 49
pushing 49
rugged 49
saturated 49
sparkling 49
spectrum 49
spice-tinged 49
strikes 49
tightens 49
underscore 49
disjointed 48
dominated 48
energetic 48
fruit-driven 48
grated 48
muted 48
restraint 48
sassafras 48
shavings 48
stunning 48
sun-dried 48
attention 47
clarity 47
cleansing 47
drop 47
grigio 47
hoisin 47
including 47
kick 47
layering 47
sweet-tart 47
weighty 47
won't 47
example 46
kicks 46
macadamia 46
matchstick 46
odd 46
pebble 46
relatively 46
simpler 46
slow 46
vanilla-scented 46
yummy 46
carmenère 45
crystallized 45
dance 45
exudes 45
flicker 45
letting 45
pleasure 45
redolent 45
retains 45
rhône 45
shiso 45
spice-filled 45
wax 45
worth 45
basil 44
bouquet 44
brick 44
clamp 44
clipped 44
fruitiness 44
future 44
ideal 44
inlaid 44
mountain 44
overly 44
paraffin 44
piercing 44
powerfully 44
satiny 44
spice- 44
themes 44
thin 44
winey 44
yeast 44
'95 43
amazingly 43
blast 43
buttered 43
full-blown 43
incredibly 43
lentil 43
pulp 43
pushed 43
resonant 43
richer 43
styled 43
true 43
vein 43
yeasty 43
(2009) 42
amber 42
building 42
cantaloupe 42
cast 42
cru</i> 42
fills 42
hallmarks 42
high-pitched 42
late-harvest 42
overlay 42
piedmont 42
punch 42
quaff 42
softening 42
substance 42
well-done 42
added 41
ambitious 41
apples 41
breezy 41
cava 41
disappointing 41
expect 41
explosive 41
hue 41
imparting 41
medium-grained 41
nearly 41
patient 41
pure-tasting 41
surrounding 41
water 41
well-embedded 41
well-oaked 41
amarone 40
appley 40
bianco 40
bouncy 40
brims 40
clumsy 40
colored 40
compelling 40
crowd-pleaser 40
d'avola 40
embedded 40
graham 40
litchi 40
meld 40
mingles 40
mixes 40
montepulciano 40
peaches 40
proportion 40
refreshingly 40
seed 40
spritz 40
tactile 40
astringency 39
bodied 39
centered 39
dancing 39
effusively 39
gold 39
heft 39
huge 39
light-footed 39
main 39
married 39
pastis 39
quick 39
resolve 39
roriz 39
sail 39
shine 39
suggest 39
augmented 38
characteristics 38
clementine 38
developing 38
exuding 38
fantastic 38
fuji 38
masses 38
overripe 38
own 38
pale 38
rock-solid 38
salinity 38
sorbet 38
trace 38
welcome 38
bottling 37
dull 37
expands 37
fades 37
fading 37
faint 37
glowing 37
grows 37
impeccably 37
isn't 37
jicama 37
lace 37
marshmallow 37
mushrooms 37
now; 37
onto 37
peak 37
pebbly 37
perfume 37
shed 37
subtly 37
talc 37
tannat 37
undercurrent 37
acacia 36
austerity 36
blanket 36
briny 36
cavaillon 36
course 36
extends 36
lack 36
mature-tasting 36
melding 36
middle 36
notably 36
otherwise 36
promises 36
quit 36
sweetie 36
wins 36
zin 36
2011) 35
atypical 35
backward 35
beneath 35
blowsy 35
bordering 35
cherry- 35
chiseled 35
cuts 35
develops 35
falls 35
fascinating 35
following 35
grow 35
hanging 35
interplay 35
join 35
leaner 35
lining 35
loses 35
presentation 35
raisins 35
ripple 35
road 35
rosso 35
sort 35
suggests 35
suppleness 35
ultimately 35
ultrarich 35
veil 35
wrap 35
aged 34
ahead 34
bacony 34
bosc 34
chimes 34
citronella 34
combining 34
dimensions 34
dominating 34
equilibrium 34
evident 34
full-throttle 34
granita 34
highly 34
international 34
introduce 34
lasts 34
lilting 34
liqueur 34
mesh 34
parfait 34
preserve 34
resinous 34
rolls 34
sculpted 34
shades 34
shell 34
slim 34
tinge 34
transparency 34
ultrafine 34
bark 33
broad-shouldered 33
extending 33
fruit-filled 33
kiwi 33
level 33
maduro 33
meats 33
mineral-driven 33
nervy 33
promise 33
rooibos 33
steak 33
stream 33
tender 33
verging 33
voluptuous 33
beguiling 32
crackling 32
creamy-textured 32
crust 32
deceptively 32
difficult 32
distinctively 32
dominant 32
friulano 32
full- 32
generosity 32
label 32
love 32
mirabelle 32
modern-style 32
molasses 32
mouthpuckering 32
preserved 32
pruny 32
shade 32
shading 32
soy 32
swirl 32
syrup 32
taking 32
velocity 32
wall 32
allure 31
blends 31
château 31
chopped 31
enlivening 31
ethereal 31
foods 31
hand 31
imparts 31
jalapeño 31
joining 31
medium-to-full 31
mocha-laced 31
oozing 31
purple 31
quaffable 31
raisined 31
scent 31
sing 31
size 31
swath 31
unfolding 31
village 31
wilted 31
allowing 30
ash 30
burgundian 30
canned 30
caresses 30
characteristic 30
clairette 30
clay 30
cocktail 30
conclusion 30
contains 30
cracker 30
cured 30
definitely 30
emphasizes 30
firm-textured 30
flashes 30
flow 30
fore 30
french 30
grapes 30
lacing 30
manner 30
mincemeat 30
patience 30
powerhouse 30
region 30
spätlese 30
strawberries 30
studded 30
superripe 30
tremendous 30
underscores 30
unique 30
winemaking 30
acid 29
aeration 29
cab 29
canaiolo 29
chilled 29
colorino 29
dusting 29
folding 29
forming 29
gingerbread 29
healthy 29
heavy-handed 29
hedonistic 29
joy 29
judicious 29
kabinett 29
kiss 29
marries 29
olives 29
paprika 29
pinotage 29
porcini 29
ripe-tasting 29
strength 29
striking 29
supersilky 29
supports 29
vintages 29
whole-grain 29
'99 28
barnyard 28
bouschet 28
brightly 28
christmas 28
contrast 28
delight 28
displayed 28
dryness 28
effectively 28
extract 28
franca 28
frothy 28
grain 28
honeycomb 28
malt 28
monolithic 28
oyster 28
race 28
remarkable 28
riveting 28
silky-textured 28
stitched 28
streamlined 28
summer 28
transparent 28
veers 28
zing 28
'94 27
<i>premier 27
alive 27
aromatically 27
beaujolais 27
cellared 27
close 27
coats 27
confit 27
defines 27
fish 27
flamboyant 27
focusing 27
gobs 27
granny 27
helps 27
leave 27
lifted 27
losing 27
mahogany 27
moving 27
nubby 27
open-weave 27
perfect 27
port-like 27
prickly 27
simply 27
singing 27
smith 27
term 27
theme 27
turkish 27
upper 27
wave 27
well-centered 27
zweigelt 27
2012) 26
abundant 26
admire 26
alongside 26
animal 26
bony 26
bubbles 26
chocolate-covered 26
continue 26
crisply 26
debut 26
drier 26
expressively 26
fancy 26
firmness 26
five 26
folds 26
harmonize 26
immediate 26
initial 26
languid 26
liveliness 26
mineral-laced 26
monastrell 26
months 26
moscato 26
neutral 26
notable 26
oozes 26
pizzazz 26
poised 26
red- 26
rich-tasting 26
ruby-garnet 26
seductively 26
softer 26
special 26
stretches 26
verges 26
acidic 25
attractively 25
breadth 25
ebullient 25
enlivens 25
evolve 25
full-flavored 25
guiding 25
immense 25
july 25
pair 25
reward 25
rioja 25
serve 25
sneak 25
sneaking 25
stewy 25
strongly 25
tame 25
tealike 25
thickly 25
twist 25
unusually 25
vanilla-tinged 25
weedy 25
youngster 25
(september 24
apart 24
barbaresco 24
beaded 24
bilberry 24
cascade 24
category 24
cool 24
crowd 24
due 24
dust 24
earl 24
enliven 24
entry 24
etched 24
extended 24
flat 24
fresh-turned 24
grüner 24
grey 24
laser 24
medium-sweet 24
opulence 24
packing 24
perfectly 24
pinched 24
proportions 24
relies 24
resonates 24
reticent 24
soil 24
stalky 24
stands 24
steam 24
suggesting 24
sumptuous 24
trebbiano 24
veering 24
vineyard 24
vitality 24
wide 24
wraps 24
2014) 23
absolutely 23
absorbed 23
aglianico 23
alcoholic 23
baby 23
blaufränkisch 23
centering 23
cheese 23
coat 23
coursing 23
cumin 23
decade 23
define 23
eiswein 23
fanning 23
flecked 23
float 23
iron-tinged 23
lavish 23
leaning 23
maybe 23
minutes 23
move 23
overt 23
peers 23
provence 23
pull 23
quaffer 23
rare 23
rigid 23
seafood 23
seriously 23
serving 23
sets 23
sipper 23
superfine 23
tails 23
tighten 23
tobacco-tinged 23
truffles 23
veneer 23
vivacious 23
waft 23
warmed 23
(january 22
allows 22
almonds 22
apéritif 22
approach 22
biting 22
brazil 22
cappuccino 22
captures 22
cider 22
citrus-tinged 22
claret 22
classico 22
coiled 22
crispness 22
crowd-pleasing 22
darker 22
detracts 22
distinction 22
filigreed 22
focuses 22
harsh 22
honeycrisp 22
humus 22
la 22
mataro 22
mouth-feel 22
particularly 22
seemingly 22
sits 22
soft-textured 22
spice-infused 22
stone-tinged 22
sweetened 22
thick-textured 22
times 22
tired 22
tons 22
treacle 22
vital 22
<i>sous-bois</i> 21
absorb 21
accompanied 21
beer 21
bordeaux-like 21
bound 21
broad-textured 21
buy 21
captivating 21
deceptive 21
domaine 21
gamay 21
getting 21
grounded 21
gumdrop 21
late 21
lose 21
lurking 21
magnum 21
pace 21
plantain 21
prevail 21
probably 21
promising 21
ribolla 21
roundness 21
sancerre 21
sherry 21
substantial 21
surround 21
svelte 21
tug 21
tuscan 21
variety 21
world 21
(march 20
ager 20
aragonez 20
bing 20
bone-dry 20
brine 20
compacted 20
court 20
courtesy 20
cruises 20
diffuse 20
earth- 20
explodes 20
extraordinary 20
facets 20
formidable 20
frank 20
glorious 20
graces 20
hands 20
herb-laced 20
herbes 20
highlighting 20
immediately 20
international-style 20
introduction 20
licorice-tinged 20
meet 20
meursault 20
mind 20
mineral- 20
mineral-infused 20
mocha-scented 20
moment 20
muscadelle 20
nerello 20
oxidized 20
plush-textured 20
prunes 20
reminds 20
roll 20
sauternes 20
silky-smooth 20
sings 20
spanish 20
spun 20
submerged 20
sufficient 20
superbly 20
supple-textured 20
surprising 20
table 20
tapered 20
tartine 20
tartness 20
tba 20
they're 20
tilts 20
uncomplicated 20
unevolved 20
wafting 20
2013) 19
additional 19
begins 19
begs 19
burnished 19
cc 19
châteauneuf 19
chicken 19
continues 19
correct 19
current 19
decanting 19
decidedly 19
dilute 19
expanding 19
exquisite 19
ferrous 19
folks 19
gialla 19
grand 19
haul 19
heavily 19
jellied 19
licorice-scented 19
lifts 19
lines 19
melds 19
merit 19
overshadowing 19
peppermint 19
perfumes 19
prosecco 19
returns 19
rough-hewn 19
salmon 19
seashore 19
shellfish 19
silk 19
sipping 19
softens 19
stern 19
tanginess 19
tannins; 19
thoroughly 19
tocai 19
unyielding 19
vin 19
volatile 19
waiting 19
well-rounded 19
wheat 19
(2010) 18
abundance 18
aims 18
appears 18
autumn 18
bad 18
bet 18
bresaola 18
brief 18
burr 18
buttercream 18
carpaccio 18
challenge 18
cloak 18
corn 18
definite 18
delightfully 18
dynamic 18
earlier 18
earth-laced 18
exuberance 18
floral-tinged 18
france 18
fruit- 18
generously 18
gush 18
herb- 18
hoping 18
incredible 18
invigorating 18
june 18
laid 18
licorice-accented 18
likable 18
likeable 18
low 18
oomph 18
peek 18
permeate 18
picpoul 18
plumped 18
pop 18
pureed 18
qualities 18
required 18
resin 18
resist 18
sailing 18
salumi 18
setting 18
sherbet 18
similar 18
smokiness 18
spearmint 18
surface 18
surrounded 18
themselves 18
tightening 18
verdejo 18
vinous 18
wait? 18
warrant 18
well-toned 18
(july 17
allow 17
aristocratic 17
aromas; 17
beet 17
blancs 17
bloom 17
bolt 17
bouillon 17
bounce 17
buoyed 17
châteauneuf-du-pape 17
citrus-laced 17
competing 17
complementing 17
creek 17
di 17
dollop 17
draped 17
evolved 17
exaggerated 17
february 17
fizz 17
fleshed 17
forceful 17
gewürz 17
hedonist 17
impeccable 17
intricate 17
lengthens 17
licorice- 17
maintain 17
marry 17
marvelous 17
milky 17
neatly 17
november 17
offsets 17
overtly 17
oxidation 17
peeking 17
pieces 17
pumps 17
remember 17
retaining 17
stretched 17
stretching 17
superclean 17
superlong 17
tensile 17
track 17
waves 17
wine's 17
winner 17
wow 17
(june 16
<i>grand 16
<i>terroir</i>-driven 16
bed 16
beyond 16
blending 16
bomb 16
bonarda 16
côte-rôtie 16
cascading 16
chicory 16
chiming 16
clamps 16
courses 16
create 16
dessert-style 16
development 16
dinner 16
dripping 16
edging 16
emphasis 16
enjoyed 16
excess 16
extraction 16
fall 16
fine-textured 16
finish--1990 16
fleshes 16
fruit-coated 16
gaminess 16
gracing 16
gushes 16
hard-edged 16
heart 16
hope 16
improving 16
infused 16
initially 16
italy 16
kicking 16
laserlike 16
leap 16
mcintosh 16
mineral-filled 16
monster 16
noticeable 16
offsetting 16
picture 16
pillowy 16
pulsing 16
reined 16
relaxed 16
sarsaparilla 16
searing 16
seduces 16
shape 16
signal 16
sit 16
sneaks 16
splash 16
spritzy 16
statement 16
struggles 16
sugary 16
sultana 16
surprise 16
swirling 16
tiny 16
tone 16
tuned 16
ultraripe 16
underlining 16
valley 16
wafts 16
what's 16
whiffs 16
wildflower 16
win 16
winning 16
(may 15
abound 15
altogether 15
anise-scented 15
barroca 15
blossoms 15
bodes 15
bourboulenc 15
broader 15
burning 15
cariñena 15
choice 15
citrus-infused 15
creating 15
cutting 15
deftness 15
drips 15
ease 15
enhanced 15
enveloping 15
equal 15
finally 15
flowing 15
forefront 15
froth 15
funk 15
greco 15
guts 15
hit 15
jolt 15
lamb 15
lavishly 15
look 15
lusciously 15
lushness 15
march 15
mosel 15
mushroomy 15
notes; 15
onion 15
openly 15
overbearing 15
pears 15
peppered 15
pomerol 15
pound 15
powdery 15
priced 15
rangy 15
reds 15
rounds 15
sample 15
santo 15
scope 15
sexy 15
shines 15
soave 15
softened 15
stones 15
struggle 15
talcum 15
traditional-style 15
treatment 15
user-friendly 15
vividly 15
volume 15
wealth 15
'03 14
admirable 14
april 14
attack 14
aussie 14
ba 14
becoming 14
bouncing 14
brightness 14
bringing 14
cinnamon-accented 14
clover 14
completely 14
converge 14
corvina 14
cruise 14
curry 14
dances 14
dashes 14
deliver 14
developed 14
discreet 14
easy-to-drink 14
encore 14
evocative 14
exceptional 14
favors 14
figs 14
fresh-crushed 14
full-bore 14
grechetto 14
hickory 14
hits 14
husk 14
immensely 14
influence 14
introduces 14
its 14
lightness 14
lilt 14
locked 14
loire 14
loosely 14
lurk 14
luxurious 14
manage 14
manseng 14
margaux 14
matches 14
melts 14
mineral-accented 14
mineral-laden 14
mouth-filling 14
nectar 14
oregano 14
overshadow 14
oysters 14
pack 14
peach- 14
persistently 14
pizza 14
plushness 14
ponderous 14
primitivo 14
pulling 14
pump 14
quietly 14
repeating 14
ripples 14
saline-tinged 14
sensational 14
served 14
settles 14
shaved 14
shining 14
shot 14
skein 14
softness 14
stitching 14
streaming 14
surrounds 14
sweet-and-sour 14
sweetly 14
tense 14
textural 14
tilting 14
traces 14
trincadeira 14
tuscany 14
uncommon 14
upfront 14
vibrantly 14
watery 14
well-formed 14
winds 14
wine; 14
wrapping 14
wrought 14
yquem 14
'89 13
2017) 13
advanced 13
aniseed 13
apricots 13
ashy 13
augment 13
available 13
barley 13
berry-laced 13
blue 13
bottled 13
camp 13
can't 13
character; 13
characterize 13
cheesy 13
cherry-scented 13
completes 13
considerable 13
crescendo 13
december 13
dramatic 13
drinker 13
eccentric 13
endless 13
expected 13
firmer 13
flitter 13
fraîche 13
fused 13
gaps 13
gossamer 13
graphite-tinged 13
gushing 13
hard-candy 13
herbed 13
integrates 13
january 13
jump 13
kaffir 13
lagrein 13
lemon- 13
lemons 13
loose 13
lushly 13
matrix 13
mocha- 13
muscat-like 13
napa 13
october 13
pervade 13
piquant 13
pork 13
punctuated 13
rendered 13
require 13
returning 13
rounding 13
rush 13
rye 13
salad 13
scented 13
shoring 13
shortage 13
smoothness 13
southern 13
streaks 13
successful 13
swarm 13
tannic; 13
tar-tinged 13
thai 13
time; 13
typically 13
usual 13
usually 13
vaguely 13
velvet 13
violet-tinged 13
vivacity 13
washington 13
well-concentrated 13
well-marked 13
well-sculpted 13
youth 13
'85 12
'93 12
(auction 12
(mourvèdre) 12
act 12
apple- 12
aren't 12
atop 12
barely 12
bass 12
blunt 12
bolstered 12
borders 12
bounds 12
brut 12
chai 12
chalk-tinged 12
checks 12
cloaked 12
coated 12
compared 12
covering 12
covers 12
deal 12
defining 12
delineated 12
delivered 12
doughy 12
du 12
eases 12
edged 12
effect 12
enormously 12
evoke 12
extroverted 12
exuberantly 12
fiano 12
finish--1982 12
fino 12
flabby 12
floral-scented 12
forth 12
found 12
foundation 12
galore 12
gelée 12
german 12
gilded 12
gorgeously 12
grained 12
harnessed 12
herb-scented 12
hours 12
impact 12
intertwined 12
lemon-citrus 12
leroy 12
les 12
lifting 12
lurks 12
mâche 12
mélange 12
marriage 12
mazuelo 12
mocha-accented 12
needle 12
negroamaro 12
northern 12
panoply 12
pasta 12
patisserie 12
pecan 12
pekoe 12
petals 12
picnic 12
piney 12
pleasurable 12
poise 12
poultry 12
powdered 12
previous 12
racing 12
record 12
reliant 12
resonate 12
return 12
rim 12
riper 12
rise 12
ruggedly 12
savage 12
shadow 12
soapy 12
steadily 12
strives 12
succeeds 12
theres 12
tobacco- 12
unfocused 12
unfurl 12
wallop 12
well-toasted 12
winding 12
wine) 12
worthy 12
(august 11
accompany 11
ball 11
barnyardy 11
baseline 11
berryish 11
big-boned 11
bourbon 11
bowl 11
brewed 11
bubble 11
bubbling 11
candidate 11
caress 11
cashmere 11
cereal 11
chorus 11
cleanly 11
clos 11
coarseness 11
covered 11
crackles 11
creamsicle 11
creeps 11
crinkly 11
day 11
demure 11
drape 11
draws 11
elderflower 11
emphasizing 11
enormous 11
envelop 11
equally 11
experience 11
explode 11
expresses 11
fare 11
finish--châteauneuf-du-pape 11
finish; 11
flourish 11
fuller 11
graciano 11
guides 11
honey-scented 11
ice 11
impresses 11
intrude 11
joins 11
keen 11
lily 11
live-wire 11
local 11
long-term 11
looks 11
maraschino 11
meshing 11
mineral-edged 11
mineral-scented 11
modulated 11
molten 11
narrowing 11
overpowering 11
pastis-soaked 11
paving 11
pinpoint 11
please 11
reduced 11
refosco 11
resiny 11
resulting 11
rolle 11
sawdust 11
sheer 11
sooner 11
south 11
steady 11
stick 11
stop 11
straight 11
stride 11
superfresh 11
supervelvety 11
tailing 11
tarte 11
tatin 11
threads 11
tinned 11
totally 11
typicity 11
ugni 11
unbalanced 11
veltliner 11
viura 11
watch 11
well-modulated 11
adequate 10
advantage 10
agiorgitiko 10
agreeable 10
airs 10
apricot-scented 10
articulated 10
australian 10
barbecue 10
belies 10
biscotti 10
blend: 10
blows 10
brick-red 10
brim 10
broaden 10
broadly 10
browne 10
cappuccio 10
cascades 10
change 10
char 10
cherry-berry 10
cherry-flavored 10
chutney 10
cinnamon-scented 10
citric 10
combined 10
compete 10
couple 10
creamlike 10
creates 10
curious 10
currant- 10
currant-laced 10
dark-hued 10
detract 10
early-drinking 10
easy-going 10
eau-de-vie 10
effortless 10
electric 10
elegant; 10
engagingly 10
enrich 10
enter 10
everyday 10
evolves 10
exactly 10
except 10
extreme 10
flecks 10
fleeting 10
fleshiness 10
floral- 10
floral-edged 10
forthcoming 10
fruit-centered 10
gaglioppo 10
gamble 10
garnet; 10
gear 10
grapy 10
gravel-laced 10
gum 10
hallmark 10
herald 10
hovering 10
ink 10
jelly 10
knits 10
lambrusco 10
lovers 10
luxuriant 10
magnificent 10
marrying 10
mulchy 10
multidimensional 10
murky 10
name 10
nera 10
no-nonsense 10
nuanced 10
overextracted 10
peat 10
pedigree 10
peony 10
pepper-scented 10
pepper-tinged 10
permeating 10
portuguese 10
praline 10
prefer 10
prime 10
puligny 10
reaching 10
reined-in 10
requires 10
reverberate 10
reverberates 10
rides 10
rolling 10
rothschild 10
round-textured 10
score 10
segue 10
senses 10
september 10
sesame 10
settling 10
sleekly 10
slide 10
smelling 10
smoke- 10
sustain 10
sweetish 10
tawny 10
terms 10
terribly 10
top-heavy 10
traminer 10
truly 10
trying 10
tutti-frutti 10
ultrarefined 10
underlie 10
underlined 10
unripe 10
vanilla- 10
verge 10
vine 10
vinegary 10
viscosity 10
warmth 10
weigh 10
welschriesling 10
wiry 10
worn 10
(6/08) 9
(november 9
2016) 9
acidity; 9
advised 9
affordable 9
alsace 9
amped 9
amply 9
anjou 9
apparent 9
avoids 9
barossa 9
beat 9
believe 9
benefits 9
blended 9
boldly 9
boost 9
bristling 9
buds 9
buttressed 9
caramelized 9
cedar-tinged 9
challenging 9
chardonnays 9
charms 9
cherry-laced 9
condrieu 9
crosses 9
cru 9
crystalline 9
cuvée 9
deepen 9
dilution 9
dissipate 9
eventually 9
express 9
feral 9
financier 9
fine-tuned 9
flair 9
flavor; 9
flirts 9
fruit; 9
glimpse 9
greenish 9
greens 9
gun 9
hardly 9
harmonizing 9
jammed 9
kirschlike 9
left 9
lengthen 9
light-textured 9
limestone 9
lingonberry 9
marking 9
mascalese 9
matcha 9
medium-intense 9
medium-term 9
melt 9
meshes 9
mid-term 9
mission 9
muscadet 9
mustard 9
musty 9
near 9
niellucciu 9
nose; 9
nutmeg-scented 9
old-style 9
orange-peel 9
orange-scented 9
pain 9
perky 9
pickle 9
portugal 9
pouring 9
pours 9
predominate 9
quiet 9
reach 9
relief 9
requisite 9
residual 9
ruby-red 9
sacrificing 9
sagrantino 9
sandy 9
signs 9
similarly 9
site 9
sneakily 9
soft-edged 9
spades 9
spice-accented 9
spiked 9
sprightly 9
squirt 9
steel 9
step 9
stew 9
subside 9
superrich 9
sustained 9
tail 9
tips 9
tobacco-accented 9
torque 9
underline 9
valpolicella 9
velvety-textured 9
vie 9
vigorous 9
vintage's 9
well-buried 9
winemaker 9
woolly 9
yield 9
youthfully 9
zinfandel-like 9
'00 8
'01 8
'74/'84/'94 8
'77/'85/'97 8
(february 8
-- 8
açaí 8
actually 8
addition 8
agile 8
anise-tinged 8
announce 8
appreciate 8
aspect 8
authoritative 8
balsa 8
barrel-fermented 8
barrels 8
bartlett 8
berrylike 8
bianca 8
blanca 8
border 8
bourgogne 8
buoying 8
côtes 8
cabernets 8
calls 8
campfire 8
camphor 8
carbon 8
carbonic 8
care 8
carignano 8
chalklike 8
chewiness 8
chilean 8
chinon 8
chocolatey 8
citrus- 8
cocoa-tinged 8
coffee-accented 8
complements 8
cookie 8
corton 8
couched 8
creep 8
culminating 8
damp 8
days 8
dazzling 8
diamond 8
dill-laced 8
dovetailing 8
draw 8
dries 8
drink-me-now 8
dry-style 8
duck 8
electrifying 8
encased 8
endowed 8
enjoyment 8
envelope 8
enveloped 8
explosion 8
faded 8
feeling 8
five-spice 8
flex 8
floating 8
floral-accented 8
foil 8
folded 8
food-friendly 8
formed 8
gas 8
gentle-edged 8
gevrey 8
glimpses 8
glows 8
graphite-filled 8
graphite-laced 8
gums 8
heaviness 8
hopes 8
indicate 8
interwoven 8
lay 8
limited 8
macabeo 8
matching 8
matured 8
melons 8
mencía 8
missing 8
moves 8
mulling 8
multilayered 8
musky 8
narrows 8
nd 8
nuits 8
oatmeal 8
olive-scented 8
one's 8
ordinary 8
oregon 8
overwhelm 8
overwhelming 8
paired 8
palate's 8
peanut 8
peeks 8
plain 8
plum- 8
powers 8
producer's 8
provençal 8
ragged 8
rate 8
ready-to-drink 8
reasonably 8
regular 8
relying 8
rendering 8
resembles 8
reverberating 8
ring 8
rippling 8
role 8
rounder 8
sauces 8
seam 8
severe 8
showcases 8
silkiness 8
sink 8
six 8
skins 8
smell 8
soak 8
somehow 8
spot 8
spread 8
sticks 8
sticky 8
strikingly 8
superfruity 8
sweet-sour 8
sylvaner 8
tapestry 8
tends 8
terroir 8
textures 8
tobacco-scented 8
underripe 8
upright 8
vanilla-laced 8
veer 8
verdelho 8
well-mannered 8
whites 8
wind 8
wisps 8
'09 7
(and 7
(april 7
<i>recorked 7
aa 7
accompanying 7
ago 7
aimed 7
aiming 7
alternative 7
amplified 7
anise- 7
aperitif-style 7
appetizing 7
apple-flavored 7
assertively 7
assyrtiko 7
attempt 7
australia 7
barbecued 7
bargain 7
begin 7
brilliantly 7
brownie 7
buoyant 7
buzz 7
cão 7
call 7
carefully 7
caressed 7
cedar- 7
cedar-laced 7
chance 7
chassagne 7
chew 7
chiffon 7
chocolate-coated 7
cigar-box 7
classically 7
clean-tasting 7
coffee-scented 7
corpulent 7
counterpoint 7
crackle 7
crammed 7
creeping 7
denying 7
dioxide 7
dressed 7
dusty-cedary 7
earthier 7
easing 7
eastern 7
effervescence 7
effervescent 7
enchanting 7
enmeshed 7
examples 7
faith 7
festive 7
finding 7
finish--yquem 7
fit 7
fizzy 7
flickers 7
flowery 7
foie 7
formerly 7
fragile 7
fresh-cracked 7
fresher 7
fruity; 7
gingersnap 7
gleam 7
graced 7
grape's 7
gras 7
gros 7
grounds 7
gruff 7
guide 7
handle 7
heavyweight 7
hidden 7
high-extract 7
hitting 7
hops 7
improvement 7
inner 7
inside 7
instead 7
intensify 7
jumps 7
kenya 7
kernel 7
knife 7
lafleur 7
lapsang 7
lashing 7
laurent 7
licorice-filled 7
light-colored 7
lime- 7
lime-tinged 7
loose-knit 7
loosen 7
magliocco 7
makrut 7
malic 7
marselan 7
max 7
meal 7
medium-ruby 7
mellowing 7
melony 7
metal 7
meunier 7
mind-blowing 7
mint-accented 7
mixture 7
mocha-infused 7
mocha-tinged 7
modern-styled 7
money 7
montrachet 7
muscles 7
natural 7
noble 7
notice 7
nouveau 7
nuttiness 7
oloroso 7
one-note 7
oodles 7
outline 7
overlaid 7
overshadows 7
oxidative 7
palomino 7
people 7
peppers 7
petrol-tinged 7
porcino 7
positive 7
practically 7
profound 7
property 7
punchy 7
racy-edged 7
rapier 7
rapierlike 7
rayas 7
reign 7
remind 7
result 7
retain 7
riserva 7
river 7
rolled 7
rosewater 7
rumble 7
rusticity 7
saint 7
samsó 7
savagnin 7
seared 7
seduction 7
seeking 7
seven 7
sherry-like 7
showcase 7
shuts 7
significant 7
single-vineyard 7
sitting 7
smooths 7
sophistication 7
souchong 7
spare 7
spice-driven 7
square 7
squeeze 7
standard 7
stem 7
stemminess 7
stolid 7
strange 7
subtleties 7
supercharged 7
sweeps 7
swirls 7
tea-accented 7
tea-tinged 7
teeth 7
texture; 7
threaded 7
threading 7
throwback 7
throws 7
tight-grained 7
tighter 7
toastiness 7
torrent 7
troia 7
twinges 7
underlay 7
underlies 7
underrated 7
unfurls 7
unravel 7
unraveling 7
variation 7
versions 7
vespolina 7
vines 7
vouvray 7
walk 7
walks 7
wash 7
weissburgunder 7
well-buffed 7
well-chilled 7
whack 7
wildflowers 7
wish 7
world-class 7
yields 7
'02 6
'88 6
'90 6
'92 6
'em 6
--mouton-rothschild 6
2008) 6
2010) 6
achieve 6
achieves 6
aggressively 6
albariño 6
albeit 6
alfrocheiro 6
american 6
anchored 6
appearance 6
applesauce 6
argentine 6
arinto 6
artfully 6
athletic 6
attributes 6
atypically 6
austrian 6
awesome 6
backseat 6
baga 6
balsam 6
beans 6
blackberry- 6
blanketing 6
blush 6
boding 6
bolstering 6
bones 6
boot 6
bottlings 6
bounty 6
braced 6
brash 6
breathtaking 6
brisk-edged 6
bristles 6
browned 6
buckwheat 6
burn 6
butter-tinged 6
buttery-tasting 6
candle 6
cap 6
capped 6
century 6
chalkiness 6
checking 6
chewy; 6
chili 6
chill 6
chocolate- 6
chocolate-scented 6
ciliegiolo 6
civilized 6
claret-style 6
closing 6
colombard 6
consumed 6
cool-climate 6
cork 6
corral 6
cream- 6
cream-filled 6
croatina 6
cross 6
custardy 6
d'épices 6
dead 6
decades 6
deeper 6
direction 6
dissolve 6
drapes 6
dusty-edged 6
earth-tinged 6
earthen 6
easy-to-like 6
enters 6
ever-so-slightly 6
evolving 6
excessive 6
excited 6
exotic-tasting 6
expensive 6
expressiveness 6
field 6
figgy 6
fight 6
firm; 6
flan 6
flavorful; 6
flight 6
flood 6
flush 6
follow-through 6
forever 6
forthright 6
framboise 6
free 6
frizzante 6
generic 6
get-go 6
gingery 6
glints 6
godello 6
gooey 6
grabs 6
gracefulness 6
granite 6
greengage 6
grillo 6
growing 6
guided 6
gushy 6
hasn't 6
headed 6
heard 6
hedonist's 6
heralds 6
honey-tinged 6
house 6
hover 6
impenetrable 6
include 6
ingredients 6
inky-black 6
innocuous 6
insolia 6
intruding 6
iris 6
ironclad 6
judge 6
late-release 6
laying 6
lead-pencil 6
lemon-spiked 6
literally 6
mâcon 6
madeira 6
maipo 6
marcona 6
masking 6
meager 6
mean 6
measured 6
medium-to-full-bodied 6
medium-to-light 6
mellowed 6
mint- 6
mocha-filled 6
monumental 6
morello 6
morgon 6
mouth-puckering 6
mouthwateringly 6
mouton 6
multifaceted 6
musk 6
nature 6
near-term 6
nobile 6
oak-accented 6
oak-infused 6
oak-tinged 6
oak; 6
obscure 6
occasion 6
olive- 6
olive-accented 6
olive-tinged 6
ooze 6
oranges 6
over-the-top 6
overblown 6
owner 6
palate-coating 6
pastrylike 6
pavie 6
pepper-accented 6
pervades 6
picked 6
piece 6
pistachio 6
plentiful 6
porty 6
pouilly 6
powered 6
pristine 6
producers 6
profusion 6
punches 6
races 6
rambunctious 6
ranging 6
rawness 6
razor-sharp 6
reflects 6
released 6
resolved 6
resonance 6
rest 6
riesling-like 6
rising 6
rooted 6
rubber 6
ruby-colored 6
rumbles 6
rushing 6
sacrifices 6
sautéed 6
sauvignons 6
sciaccarellu 6
seasoned 6
seasoning 6
seat 6
shapes 6
shaping 6
shore 6
shrouded 6
shut 6
single 6
slender 6
soda 6
sold 6
sonoma 6
soothing 6
sorts 6
soulful 6
sousão 6
spain 6
sparkles 6
spice-flavored 6
spice-laced 6
squarely 6
st-emilion 6
straight-ahead 6
strawberry- 6
streaking 6
structures 6
stuffed 6
stunner 6
sunny 6
surfaces 6
surge 6
surplus 6
sweat 6
sweeter 6
tanned 6
taper 6
teetering 6
tell 6
teriyaki 6
teroldego 6
terrifically 6
thrust 6
tightness 6
tingly 6
tobacco-laced 6
tooth 6
tough-edged 6
towards 6
treat 6
trimmer 6
twang 6
type 6
ultrasmooth 6
unbelievable 6
underlines 6
unwinds 6
vanilla-flavored 6
vinegar 6
vineyards 6
vougeot 6
weak 6
weightless 6
welcoming 6
well-executed 6
well-framed 6
well-submerged 6
wispy 6
yielding 6
you'll 6
zealand 6
zips 6
'86 5
<i>sauvage</i> 5
accompaniment 5
aficionados 5
aftertaste--1989 5
ages 5
aligned 5
almond-accented 5
amounts 5
approaching 5
arneis 5
athiri 5
augments 5
authentic 5
availability 5
avoid 5
bélair-monange 5
balsamico 5
bananas 5
bar 5
basically 5
belie 5
below 5
bent 5
beware 5
black-colored 5
blackstrap 5
blooms 5
bode 5
boiled 5
boisterous 5
bracingly 5
brandied 5
bread-dough 5
break 5
breed 5
breeze 5
brightened 5
brighter 5
broadens 5
brute 5
buffer 5
burgers 5
burns 5
cabs 5
canino 5
cannonau 5
canon 5
capture 5
caramel-scented 5
caraway 5
carpet 5
cellaring; 5
center-palate 5
centers 5
chalk-framed 5
character-filled 5
charcoal- 5
charmer 5
charmingly 5
cheeses 5
cherry 5
chervil 5
chewy-edged 5
chile 5
chinese 5
chocolate-filled 5
chocolate-tinged 5
chop 5
cidery 5
cilantro 5
clever 5
cling 5
closes 5
coffee-tinged 5
colors 5
compensate 5
considered 5
copper 5
coppery 5
cornas 5
crémant 5
creamy-edged 5
croissant 5
crozes 5
crumble 5
crystal 5
cucumber 5
darkly 5
decadently 5
delivery 5
demonstrates 5
denote 5
dig 5
distinguish 5
distracting 5
dosed 5
downright 5
draping 5
drunk 5
dumb 5
dusted 5
echoed 5
entwined 5
envelops 5
esoteric 5
evolution 5
excitement 5
expense 5
exploding 5
explosively 5
exterior 5
faintly 5
fair 5
fashion 5
fast 5
fermentation 5
fillip 5
finish--diamond 5
fits 5
flawless 5
fleshier 5
flittering 5
force 5
forms 5
fray 5
fresh-chopped 5
fronting 5
fruitcake-filled 5
fuse 5
gangly 5
garganega 5
gather 5
gem 5
gilding 5
glassy 5
gloriously 5
glow 5
golden-colored 5
grab 5
grapefruit-lime 5
graphite- 5
graphite-fueled 5
greatness 5
greenness 5
grip-filled 5
grit 5
grown 5
guarding 5
gusto 5
hardness 5
haunting 5
herb-driven 5
herb-edged 5
honeylike 5
hums 5
icing 5
idiosyncratic 5
imagine 5
improves 5
in-your-face 5
incisive 5
includes 5
indicates 5
influences 5
integrity 5
interpretation 5
intrigue 5
intriguingly 5
iron-clad 5
iron-filled 5
irresistible 5
jacquère 5
jam-packed 5
jerky 5
joint 5
jos 5
kanonkop 5
knockout 5
lactic 5
languidly 5
las 5
laser-sharp 5
lemon-tinged 5
licorice-laced 5
lilacs 5
lime-scented 5
limnio 5
liven 5
loaminess 5
long-lasting 5
looking 5
lovage 5
luce 5
lunchtime 5
majestic 5
makers 5
marvelously 5
masks 5
maximum 5
means 5
meets 5
memorable 5
michel 5
middle-of-the-road 5
miles 5
mind-boggling 5
minerally-tasting 5
modicum 5
monolith 5
moschofilero 5
myrrh 5
neither 5
noirs 5
nor 5
normal 5
nougat 5
nutmeg- 5
oak-aged 5
offbeat 5
offerings 5
ok 5
old-vine 5
organic 5
overdone? 5
overflowing 5
overoaked 5
override 5
overshadowed 5
owes 5
palatable 5
partner 5
pasty 5
pauillac 5
pebbles 5
pedro 5
pennyroyal 5
petal-accented 5
phase 5
phenomenal 5
picolit 5
pie-crust 5
pin 5
pineapples 5
pinots 5
plate 5
pleasingly 5
plodding 5
plum-laced 5
plumpness 5
pommard 5
popcorn 5
possesses 5
potpourri 5
pour 5
prüm 5
premier 5
prettily 5
primal 5
primary 5
private 5
purer 5
quaffing 5
raspberry-scented 5
rear 5
reasonable 5
recede 5
redeeming 5
redwood 5
regional 5
reining 5
relax 5
rhône-like 5
rheingau 5
rich-textured 5
ringer 5
rings 5
rises 5
rondinella 5
rosa 5
rouge 5
rough-and-tumble 5
savoriness 5
scallion 5
secondary 5
seducer 5
settled 5
sheen 5
shirazes 5
shoulder 5
shoulders 5
sign 5
signals 5
silky-edged 5
sinew 5
sleeker 5
slightest 5
smoky-tasting 5
smolders 5
smoother 5
sneaky 5
sniff 5
sound 5
spark 5
sparks 5
spice-scented 5
spice; 5
spicy-toasty 5
spiky 5
spry 5
st 5
standards 5
straightens 5
straightfoward 5
strapping 5
string 5
strut 5
sublayer 5
suited 5
super-long 5
superconcentrated 5
superracy 5
swathed 5
symphony 5
tamed 5
teasing 5
tempered 5
tenderness 5
third 5
thoroughbred 5
tilt 5
tiring 5
toast- 5
toast-driven 5
tongue 5
trail 5
trailing 5
tree 5
tries 5
tune 5
ultrathick 5
undercurrents 5
unencumbered 5
unexciting 5
unexpected 5
unmistakably 5
untamed 5
utterly 5
vanilla-bean 5
venture 5
vernaccia 5
vibrates 5
vibrating 5
vigor 5
vinified 5
volnay 5
vosne 5
waits 5
well-layered 5
well-placed 5
well-polished 5
wide-open 5
wishing 5
wisp 5
wows 5
&amp; 4
'01s 4
'04 4
'08 4
'97s 4
2000--1961 4
2007s 4
adventurous 4
aftertaste--1990 4
age-worthy 4
aging; 4
aidani 4
align 4
almond-tinged 4
am 4
amplitude 4
announces 4
antique 4
appearing 4
aside 4
asphalt 4
au 4
augmenting 4
august 4
authority 4
awhile 4
barklike 4
barolos 4
beams 4
bears 4
beaujolais-like 4
beerenauslese 4
berry- 4
berry-flavored 4
bigger 4
biscuity 4
blanche 4
blanketed 4
blaze 4
blazing 4
blossoming 4
blow 4
blueberries 4
body; 4
botrytised 4
brandy 4
bravo! 4
brickish 4
brioche-tinged 4
broadening 4
bruising 4
buck 4
bundle 4
butterscotchy 4
cèpe 4
côt 4
calm 4
campari 4
caps 4
caramel-tinged 4
cares? 4
cashew 4
casts 4
casual 4
catarratto 4
caymus 4
cellar-worthy 4
chalk-edged 4
chalone 4
chambolle 4
changing 4
characterful 4
charcuterie 4
chave 4
chock 4
chocolate-infused 4
cinnamon-tinged 4
citrus-peel 4
citruslike 4
clamping 4
claylike 4
climate 4
clotted 4
clove-scented 4
cloves 4
co2 4
cocoa-filled 4
coffee-flavored 4
cognac 4
cohesion 4
cohesive 4
cola-scented 4
cold 4
complain 4
complicated 4
concentration; 4
concludes 4
considerably 4
consistently 4
constructed 4
continuing 4
cooler 4
corralled 4
corralling 4
creme 4
cruising 4
crunch 4
crushed-rock 4
culminates 4
cup 4
curt 4
dal 4
dank 4
decadence 4
deep-colored 4
delineation 4
deny 4
depths 4
dijon 4
directions 4
disarming 4
distance 4
distinguished 4
distinguishes 4
distributed 4
dollops 4
dosage 4
doubt 4
drawing 4
drc 4
dryish 4
durif 4
eating 4
eau 4
ebulliently 4
edginess 4
else 4
embracing 4
enhance 4
enjoying 4
epitome 4
exceptionally 4
extravagant 4
fabric 4
fabulously 4
fails 4
falling 4
favorite 4
figeac 4
fine-grain 4
finest 4
finish—non-blind 4
finish--cheval-blanc 4
finished 4
flaccianello 4
flanking 4
flashing 4
flaunts 4
flexing 4
flintiness 4
flows 4
follow-up 4
forced 4
format 4
foursquare 4
frappato 4
fringed 4
fruited 4
fruitier 4
fuel 4
furniture 4
future; 4
gamelike 4
gavi 4
genuine 4
geranium 4
giallo 4
gigondas 4
glistens 4
glossy 4
grains 4
greets 4
grolleau 4
grosso 4
guava-accented 4
guess 4
gunmetal 4
half 4
ham 4
haylike 4
hazelnut-scented 4
herb-accented 4
herb-marinated 4
herbaceousness 4
hermitage 4
hewn 4
high-acidity 4
hip 4
honey- 4
horsey 4
hour 4
howell 4
hued 4
hunting 4
hurry 4
hurt 4
i've 4
integrating 4
intrusive 4
ith 4
jangly 4
java 4
job 4
kaleidoscope 4
kerner 4
laden 4
large-scaled 4
laurel 4
lbv 4
leanness 4
ledger 4
lees 4
legendary 4
legume 4
letdown 4
lies 4
lighter-bodied 4
limes 4
live 4
livelier 4
livens 4
long-ager 4
low-acidity 4
lunch 4
lush-textured 4
müller 4
müller-thurgau 4
macaroon 4
mace 4
macquin 4
malolactic 4
manzanilla 4
mars 4
martha's 4
masculine 4
massively 4
meatiness 4
meaty-tasting 4
medium-bodied; 4
medium-garnet 4
mid-palate 4
mineral-like 4
mint-tinged 4
minty-herbal 4
mistaking 4
mondavi 4
mouth-coating 4
mouvèdre 4
mulch 4
muskateller 4
nielluccio 4
night 4
nimble 4
notch 4
noticeably 4
noval 4
now88/98 4
now--the 4
obtrusive 4
obviously 4
openness 4
oseleta 4
out; 4
outlast 4
outside 4
overriding 4
overwhelmed 4
owned 4
owners 4
packaged 4
pairs 4
papery 4
parsley 4
party 4
patch 4
path 4
peach-infused 4
pear-laced 4
pearlike 4
peaty 4
peelaccented 4
peel-accented 4
peel-scented 4
perfumey 4
perk 4
pierces 4
pineapple-accented 4
pinor 4
pins 4
piny 4
pipe 4
plum-scented 4
poke 4
poking 4
popping 4
portion 4
precedes 4
preceding 4
prevailing 4
prevails 4
prevalent 4
produced 4
project 4
properly 4
prototypical 4
puckering 4
pulled 4
pumped 4
pumped-up 4
putting 4
quirky 4
racier 4
raspberry-tinged 4
raspy 4
raucous 4
raw-edged 4
razor 4
recent 4
red's 4
reflecting 4
refreshment 4
region's 4
remember--1997 4
rendition 4
representative 4
resting 4
results 4
revolving 4
revs 4
rieslings 4
rocket 4
rocky 4
roditis 4
roles 4
roupeiro 4
rum 4
rumbling 4
sage-laced 4
samples 4
sandalwood-tinged 4
sangioveto 4
santa 4
saturate 4
scheurebe 4
schiava 4
scintillating 4
screw 4
seashell 4
segues 4
sensual 4
series 4
sgn 4
shaped 4
sharpness 4
signed 4
simmer 4
simplicity 4
sips 4
skinny 4
skitter 4
slate-filled 4
slate-infused 4
slip 4
smoothed 4
smoothing 4
soya 4
space 4
spicy-tasting 4
spotlight 4
stacked 4
stale 4
standing 4
stingy 4
strawberry-rhubarb 4
stray 4
strays 4
strike 4
stronger 4
strongest 4
structuring 4
struggling 4
styles 4
stylistically 4
subnote 4
suitable 4
super-firm 4
super-fresh 4
superlative 4
supersmooth 4
supersoft 4
supersupple 4
surely 4
sustains 4
sweaty 4
sweet; 4
sweets 4
tag 4
tar-laced 4
tartly 4
tautly 4
tea- 4
tea-infused 4
telltale 4
tend 4
thickness 4
threaten 4
thurgau 4
tightrope 4
tinny 4
tinto 4
tintorera 4
toffee-scented 4
tokay 4
toned 4
tour 4
tradition 4
traditionally 4
trapiche 4
treixadura 4
tremendously 4
trick 4
triumph 4
troubling 4
tumble 4
ultravelvety 4
unabashedly 4
uncommonly 4
uncompromisingly 4
undergrowth 4
underpinned 4
undeveloped 4
unfurling 4
unimpeded 4
unobtrusive 4
vague 4
valpo 4
vanilla-spice 4
varieties 4
veneto 4
vidal 4
vino 4
violet-scented 4
voluptous 4
walnuts 4
wears 4
weighted 4
well-coated 4
well-honed 4
well-matched 4
well-muscled 4
well-poised 4
well-rendered 4
whistle 4
winery's 4
woods 4
worcestershire 4
workmanlike 4
wrestle 4
xarel-lo 4
ximénez 4
xinomavro 4
years' 4
